#+title:      B Klasse 2021-25
#+date:       [2022-12-30 Fr 19:36]
#+filetags:   :3b:Project:
#+identifier: 20221230T193609
#+STARTUP: showall
#+STARTUP: logdone
#+STARTUP: lognotedone
#+CATEGORY: golling
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width \linewidth
#+OPTIONS: toc:nil
#+export_file_name: ~/RoamNotes/exports/3b.html
#+AUTHOR: Matthias Fuchs
#+EMAIL: matthiasfuchs01@gmail.com

* 3B [KV Lena ]
#+Name: 2021-students
| First    | Last               | Name                     | Note | Mitarbeit     | Heft | LZK |
|----------+--------------------+--------------------------+------+---------------+------+-----|
| Anja     | Breinlinger        | [[Anja Breinlinger][Anja Breinlinger]]         |      |               |      |     |
| Dalya    | Durukan            | [[Dalya Durukan][Dalya Durukan]]            |      |               |      |     |
| Tobias   | Egger              | [[Tobias Egger][Tobias Egger]]             |      | HÜ nix        |      |     |
| Azra     | Hant               | [[Azra Hant][Azra Hant]]                |      |               |      |     |
| Hannah   | Hauser             | [[Hannah Hauser][Hannah Hauser]]            |      |               |      |     |
| Matthias | Holler             | [[Matthias Holler][Matthias Holler]]          |      | 3             |    3 |   3 |
| Andreas  | Hollweger          | [[Andreas Hollweger][Andreas Hollweger]]        |      |               |      |     |
| Andrea   | Ivanovic           | [[Andrea Ivanovic][Andrea Ivanovic]]          |      |               |      |     |
| Jonas    | Jarnig             | [[Jonas Jarnig][Jonas Jarnig]]             |      | HÜ nix      3 |    3 |   3 |
| Fabian   | Klöß               | [[Fabian Klöß][Fabian Klöß]]              |      | HÜ nix        |      |     |
| Evelyn   | Nestler            | [[Evelyn Nestler][Evelyn Nestler]]           |      |               |      |     |
| Julia    | Schlager-Weidinger | [[Julia Schlager-Weidinger][Julia Schlager-Weidinger]] |      |               |      |     |
| Felix    | Schmegner          | [[Felix Schmegner][Felix Schmegner]]          |      |               |      |     |
| Annika   | Schmitzberger      | [[Annika Schmitzberger][Annika Schmitzberger]]     |      |               |      |     |
| Kristina | Sokic              | [[Kristina Sokic][Kristina Sokic]]           |      |               |      |     |
| Augustin | Sommer             | [[Augustin Sommer][Augustin Sommer]]          |      | 3             |    3 |   3 |
| Phillipp | Spagolla           | [[Phillipp Spagolla][Phillipp Spagolla]]        |      |               |      |     |
| Emma     | Tikvic             | [[Emma Tikvic][Emma Tikvic]]              |      |               |      |     |
| Selina   | Weiss              | [[Selina Weiss][Selina Weiss]]             |      |               |      |     |
| Samuel   | Wittner            | [[Samuel Wittner][Samuel Wittner]]           |      |               |      |     |
#+TBLFM: $4=vmean($5..$>);%.0f
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(Mitarbeit,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':ID: ' + first + '' + last + '')
      print(':END: ')
      print('#+Name: ' + first + '' + last + '')
      print('|-------+-------+------+---------|')
      print('| Datum | Topic | Note | Notizen |')
      print('|-------+-------+------+---------|')
      print('\n')
      print('*** Note ' + first + ' ' + last + '')
      print('#+Name: Note_' + first + '' + last + '')
      print('|-----------+-------------+-----+-----------+------------|')
      print('| Mitarbeit | Heft / Buch | LZK | Sonstiges | Gesamtnote |')
      print('|-----------+-------------+-----+-----------+------------|')
      print('|         2 |           3 |   2 |         3 |        2.5 |')
      print('#+TBLFM: $5=vmean($1..$4)')
      print('\n')
#+END_SRC

#+RESULTS:
